const ERR_CODE = {
  // 工程相关
  2000: "创建工程出错",
  2001: "未找到工程信息",
  2002: "无 uiVersion 信息",
  2003: "加载工程失败",
  2004: "更新失败",
  2005: "获取工程失败",
  2006: "缺少参数",

  // 配置相关
  3000: "配置文件不存在",
  3001: "模板版本信息错误",
  3002: "获取资源配置失败",
  3003: "页面预览配置读取失败",
  3004: "未选择UI版本",
  3005: "未找到模板描述文件",
  3006: "资源没有配置路径",
  3007: "未选择厂商",
  3008: "资源配置路径错误",
  3009: "解析失败",

  // 资源相关
  4000: "图片路径为空",
  4001: "图片文件不存在或未知图片格式",
  4002: "图片加载失败",
  4003: "源文件不存在",
  4004: "写入文件失败",
  4005: "描述文件不存在",
  4006: "拷贝资源失败",
  4007: "删除资源失败"
};

export default ERR_CODE;
